<html>
<head>
<title>net CMS Online-Hilfe</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#000000" vlink="#000000" alink="#000000" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<p align="left"><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="4"><a name="menue"></a></font></b></font><img src="kontexthilfe/kopf_pagix.gif" width="500"></p>
<p align="center"><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="4">Pagix-Online-Hilfe</font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"> 
  <script language="JavaScript">
focus();
resizeTo(500,600);
</script>
  </font></b></font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="3"><br>
  Inhaltsverzeichnis </font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"> <a href="#einleitung"><font size="2">Einleitung</font></a></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="#anmeldung">Anmeldung</a></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="#menue">Men&uuml;f&uuml;hrung/Bedienung</a></font></p>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td width="10">&nbsp;</td>
    <td align="left" valign="top"> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#editieren">Editieren<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Medien">Medien<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Vorschau">Vorschau<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Speichern">Speichern<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Module">Module<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Verwalten">Verwalten<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#Benutzer">Benutzer<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#einstellungen">Optionen</a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#admin"><br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#hilfe">Hilfe</a></font></p>
      </td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="#arbeitsschritte">Typische 
  Arbeitsschritte</a></font></p>
<table width="100%" border="0" cellspacing="0" cellpadding="0">
  <tr> 
    <td width="10">&nbsp;</td>
    <td align="left" valign="top"> 
      <p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#arbeitsschritte_1">Eine 
        bestehende Seite bearbeiten<br>
        </a><a href="#arbeitschritte_2">Eine neue Seite anlegen und einen internen 
        Link darauf einrichten<br>
        </a><a href="#arbeitsschritte_3">Ein neues Bild einbinden<br>
        </a></font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#arbeitschritte_4">Eine 
        Word-, Exel-, Powerpoint- oder PDF-Datei einbinden</a></font></p>
    </td>
  </tr>
</table>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="#informationen">Informationen</a></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="#begriffe">Wichtige 
  Begriffe</a></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="kontexthilfe/pagix72dpi.PDF" target="_blank">Das 
  aktuelle Handbuch in Bildschirmaufl&ouml;sung als PDF zum Download (1.4 MB)</a> 
  </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><a href="kontexthilfe/pagix300dpi.PDF" target="_blank">Das 
  aktuelle Handbuch in Druckeraufl&ouml;sung als PDF zum Download (ca. 10 MB)</a> 
  </font></p>
<hr>
<font face="Verdana, Arial, Helvetica, sans-serif" size="1"> </font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="3"><b><font size="4"><a name="einleitung"></a>Einleitung:</font></b></font><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><br>
  </b></font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Ihre neue Website 
  - eine runde Sache und f&uuml;r immer aktuell</font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">net bietet Ihnen 
  mit Pagix gleich zweierlei: eine eigens nach Ihren spezifischen Bed&uuml;rfnissen 
  gestaltete Website und die M&ouml;glichkeit, diese &uuml;ber das Content-Management-System 
  der net AG kinderleicht und jederzeit mit neuen Inhalten zu f&uuml;llen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Pagix gibt es 
  in den zwei Varianten Pagix S und Pagix M.</b><br>
  In beiden F&auml;llen bekommen Sie eine von net gestaltete autonome Website, 
  die Sie auf jedem beliebigen Server am Ort Ihrer Wahl betreiben k&ouml;nnen.<br>
  Zus&auml;tzlich erhalten Sie Zugang zum net-CMS, einer im net-Rechenzentrum 
  betriebenen Software, mit der Sie auf Ihrer Website schnell und einfach neue 
  Inhalte (Text, Bilder, Sounds) einpflegen und verwalten k&ouml;nnen. Durch diese 
  ASP-L&ouml;sung Ihrer Content-Management-Bed&uuml;rfnisse k&ouml;nnen Sie Ihre 
  Website auch ohne IT-Kenntnisse redaktionell betreuen; ohne dabei in teure Lizenzen, 
  extra Software oder aufwendiges Equipment investieren zu m&uuml;ssen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Pagix S, die 
  Einsteiger-L&ouml;sung:</b><br>
  o Ein Design aus dem net-Design-Pool.<br>
  o Nutzung der CMS-Funktionen, inkl. Bildbearbeitung.<br>
  o Ein zentraler Zugang f&uuml;r viele Benutzer (1 URL, 1 Benutzername, 1 Kennwort).</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Pagix M, die 
  Business-L&ouml;sung:</b><br>
  o Ein ma&szlig;geschneidertes Design<br>
  o Vier Templates (Designvorlagen), inkl. Aufbau der Templatefunktionen und &Uuml;bernahme 
  derselben in das net-CMS.<br>
  o Abbildbarer Workflow<br>
  o Zwei Zug&auml;nge f&uuml;r viele Benutzer (2 URL, 2 Benutzernamen, 2 Kennworte)</font></p>
<p> <font face="Verdana, Arial, Helvetica, sans-serif" size="1"><br>
  <b>FAKTEN</b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>1 Vorteile ASP 
  (Application Service Providing) auf einen Blick</b><br>
  o Immer aktuelle Software.<br>
  o Lizenzkosten entfallen.<br>
  o Spezielle IT-Kenntnisse nicht notwendig.<br>
  o Kalkulierbarkeit und Planbarkeit des Kostenfaktors.<br>
  o Keine extra Hardware.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>2 Pagix - Fakten</b><br>
  o Autonome Webpr&auml;senz.<br>
  o Vorschau-Funktion.<br>
  o Unabh&auml;ngigkeit von Agenturen.<br>
  o Bildbearbeitungsfunktion.<br>
  o Beliebige Content-Formate.<br>
  o Leicht verst&auml;ndliche Benutzer-Oberfl&auml;che.<br>
  o Dezentrale Pflege (Zugriff auf das System von jedem beliebigen Ort).<br>
  o Keine Userbegrenzung.<br>
  o Keine extra Client-Software; Browsergesteuert.<br>
  o Automatische Pr&uuml;fung der Link-Konsistenz.<br>
  o Seiten ohne Limitierung erzeugen, verwalten und editieren (ab pagix M).<br>
  o Sicherheit durch Trennung von Layout und Inhalt.<br>
  o Live-Schaltung per Knopfdruck.<br>
  o Erweiterbarkeit (weitere Funktionen k&ouml;nnen &uuml;ber Module zugeschaltet 
  werden).</font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Diese Hilfe 
  soll Sie in der Bedienung von Pagix unterst&uuml;tzen. In dieser universalen 
  Anleitung werden m&ouml;glicherweise auch Funktionen erl&auml;utert, die in 
  Ihrem Paket nicht freigeschaltet sind. </b></font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<hr>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="3"><b><font size="4"><a name="anmeldung"></a>Anmeldung</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">&Ouml;ffnen Sie 
  Ihren Webbrowser und geben in die Adressenzeile die Adresse des Pagix-Servers 
  an:</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">http://cms.helios..net</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Es empfiehlt sich, 
  diese Adresse unter Favoriten zu speichern, um einen schnellen Zugriff zu haben.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Sie erhalten die 
  links abgebildete Einwahlmaske. Geben Sie nun den Benutzernamen und das Passwort 
  ein, welches Sie von  oder Ihrem Systemadministrator erhalten haben.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die Zugangsdaten 
  sollten Sie unbedingt an einem f&uuml;r Dritte unzug&auml;nglichen Ort aufbewahren, 
  damit keine unberechtigte Person &Auml;nderungen an Ihrer Website durchf&uuml;hren 
  kann.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Bei der Eingabe 
  falscher oder unvollst&auml;ndiger Daten erhalten Sie eine Fehlermeldung. Setzen 
  Sie sich gegebenenfalls mit unserem Kundenservice in Verbindung (Kontaktdaten 
  im Bereich &#132;Informationen&#147;).</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach erfolgreicher 
  Anmeldung wird der links abgebildete Startbildschirm sichtbar. Dort werden Sie 
  auch &uuml;ber aktuelle Erweiterungen und &Auml;nderungen von Pagix informiert. 
  Au&szlig;erdem k&ouml;nnen Sie sich hier die aktuelle Version des Pagix-Handbuchs 
  als PDF-Datei herunterladen.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<hr>
<font face="Verdana, Arial, Helvetica, sans-serif" size="3"><b><br>
<font size="4"><a name="menue"></a>Men&uuml;f&uuml;hrung / Bedienung:</font></b></font>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Hier geben wir 
  Ihnen eine &Uuml;bersicht, welche Funktionen sich hinter den Men&uuml;punkten 
  verbergen bzw. welchen Men&uuml;punkt Sie w&auml;hlen m&uuml;ssen, um einen 
  bestimmten Arbeitsschritt auszuf&uuml;hren.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="editieren"></a>Editieren:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Im Bereich Editieren 
  k&ouml;nnen Sie Seiten zu Ihrer Pr&auml;senz hinzuf&uuml;gen, Seiten l&ouml;schen 
  und bisher erstellte Seiten &auml;ndern. Weiterhin k&ouml;nnen Sie hier Ihre 
  Informationen in Ordner strukturieren.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Verzeichnisbaum</b>: 
  Auf der linken Seite finden Sie einen Verzeichnisbaum, der eine &Uuml;bersicht 
  der Seiten Ihrer Internetpr&auml;senz bietet, die Sie mit Pagix pflegen k&ouml;nnen. 
  Um eine vorhandene Seite zu bearbeiten, klicken Sie darauf. Der Name der aktuellen 
  Seite wird farblich hinterlegt. Um diese Auswahl wieder aufzuheben, klicken 
  Sie auf &quot;Homepage&quot; an der Spitze des Dateibaumes. Unterhalb der Dokumenten&uuml;bersicht 
  finden Sie verschiedene Buttons mit Funktionen, die je nach Umgebung/gew&auml;hltem 
  Men&uuml; ausf&uuml;hrbar oder nicht ausf&uuml;hrbar (dann abgeschw&auml;cht 
  dargestellt) sind. Eine neue Seite k&ouml;nnen Sie erstellen, indem Sie auf 
  &quot;Neue Seite&quot; klicken, einen neuen Ordner, indem Sie auf &quot;Neuer 
  Ordner&quot; klicken. Einen Ordner &ouml;ffnen Sie, wenn Sie auf das Pluszeichen 
  neben dem Ordner klicken. Sie k&ouml;nnen Seitennamen und den Dateinamen einer 
  Seite &auml;ndern, sowie eine Kopie einer Seite anlegen bzw. eine Seite in einen 
  anderen Ordner verschieben, indem Sie die Seite anw&auml;hlen und dann auf den 
  Button &quot;&Auml;ndern&quot; unterhalb des Verzeichnisbaums dr&uuml;cken. 
  Wenn Sie den Namen bzw. den Dateinamen der Seite &auml;ndern wollen, geben Sie 
  die &Auml;nderung ein und klicken auf &quot;&Uuml;bernehmen&quot;. Wenn Sie 
  eine Kopie erstellen wollen, dann klicken Sie auf &quot;Eine Kopie dieser Seite 
  erstellen&quot;. Wenn Sie die Seite in einen anderen Ordner verschieben wollen, 
  dann w&auml;hlen Sie den Zielordner aus dem Drop-Down-Men&uuml; und best&auml;tigen 
  Sie mit &quot;&Uuml;bernehmen&quot;. Sollten Buttons nicht anw&auml;hlbar sein, 
  kann an dieser Stelle die Funktion nicht ausgef&uuml;hrt werden.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Neue Seite anlegen:<br>
  </b>Wenn Sie eine neue Seite erstellen wollen, dann klicken Sie auf &#132;Neue 
  Seite&#147;.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zun&auml;chst w&auml;hlen 
  Sie den Seitentyp aus und best&auml;tigen mit &#132;&Uuml;bernehmen&#147;.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Danach erscheint 
  eine Maske, in die Sie den Namen f&uuml;r die Seite eingeben.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach der Best&auml;tigung 
  erhalten Sie per Drop-Down-Men&uuml; die M&ouml;glichkeit, eine Vorlage f&uuml;r 
  die Seite auszuw&auml;hlen. Au&szlig;erdem erscheint der Dateiname der Seite 
  (erkennbar an der Endung: &#132;.html&#147;) den Sie gegebenenfalls abweichend 
  von dem Seitennamen vergeben k&ouml;nnen. Aus Gr&uuml;nden der &Uuml;bersichtlichkeit 
  empfiehlt sich jedoch eine einheitliche Benennung. Die Endung &#132;.html&#147; 
  m&uuml;ssen Sie unbedingt beibehalten.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die gew&auml;hlte 
  Vorlage bestimmt wesentlich das Aussehen der Seite. Die meisten Vorlagen werden 
  die &uuml;bergeordnete Men&uuml;f&uuml;hrung beinhalten, die die Verkn&uuml;pfung 
  der Seiten untereinander regelt, so wie es der Designer vorgesehen hat. Sie 
  sollten daher nur die Vorlage f&uuml;r die neue Seite w&auml;hlen, die zum Inhalt 
  der neuen Seite passt. Innerhalb der Vorlagen sind editierbare Seitenbereiche 
  als Platzhalter vorgesehen, in die Sie Inhalte eingeben k&ouml;nnen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach Auswahl der 
  Vorlage und Best&auml;tigung der Auswahl m&uuml;ssen Sie die Datei links im 
  Verzeichnisbaum ausw&auml;hlen - gegebenenfalls durch Klick auf &#132;Homepage&#147; 
  oder den &uuml;bergeordneten Ordner die Darstellung aktualisieren, falls die 
  neue Seite noch nicht angezeigt wird. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Danach werden Ihnen 
  die Platzhalter (editierbare Seitenbereiche) angezeigt, die Sie nun mit Inhalt 
  f&uuml;llen k&ouml;nnen.</font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><br>
  </font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Seite mit Inhalt 
  f&uuml;llen bzw. bearbeiten:</b><br>
  W&auml;hlen Sie die gew&uuml;nschte Seite im Verzeichnisbaum links - sie wird 
  dann farblich hinterlegt.<br>
  Mit der Seitenvorschau k&ouml;nnen Sie sich einen &Uuml;berblick &uuml;ber die 
  Seite verschaffen. Klicken Sie auf den editierbaren Seitenbereich, den Sie zu 
  &auml;ndern w&uuml;nschen. Je nachdem, f&uuml;r welche Art von Inhalt der editierbaren 
  Seitenbereich definiert wurde, k&ouml;nnen Sie nun neue Texte, Bilder, etc. 
  einpflegen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn Sie ein neues 
  Objekt einf&uuml;gen wollen, dann w&auml;hlen Sie unter &#132;Neues Objekt einf&uuml;gen&#147; 
  per Drop-Down-Men&uuml; den gew&uuml;nschten Objekttyp aus (falls mehrere Objekttypen 
  m&ouml;glich sind) und klicken dann auf &#132;&Uuml;bernehmen&#147;. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Je nach Objekttyp 
  k&ouml;nnen Sie nun Text oder &Uuml;berschriften eingeben, Bilder ausw&auml;hlen 
  und Verkn&uuml;pfungen erstellen.<br>
  Bei &#132;Text&#147; (sowie &#132;&Uuml;berschriften&#147; und &#132;Zwischen&shy;&uuml;berschriften&#147;) 
  geben Sie den gew&uuml;nschten Text in die Maske ein und klicken auf &#132;&Uuml;bernehmen&#147;.<br>
  Bei &#132;Interner Link&#147; k&ouml;nnen Sie per Drop-Down-Men&uuml; die Seite 
  bestimmen, auf die verzweigt werden soll, wenn sp&auml;ter der Linkname, den 
  Sie vergeben, angeklickt wird. Sie k&ouml;nnen mit der Option &#132;Link in 
  neuem Fenster &ouml;ffnen&#147; beim anklicken das &Ouml;ffnen eines neuen Fensters 
  erzwingen. Ansonsten wird in das bestehende Fenster verlinkt. Best&auml;tigen 
  Sie Ihre Eingaben wiederum mit &#132;&Uuml;bernehmen&#147;.<br>
  Das Medium &#132;Bild&#147; setzt voraus, dass das entsprechende Bild schon 
  auf den Server geladen wurde. Sehen Sie dazu unter der Rubrik &#132;Medien&#147; 
  nach. Die Bildgr&ouml;&szlig;en k&ouml;nnen - je nach Vorgabe des editierbaren 
  Seitenbereichs - entweder fest oder flexibel sein.<br>
  Der Objekttyp &#132;Bild mit Auto-Gr&ouml;&szlig;e&#147; steht f&uuml;r Bilder, 
  die sich an zuvor in der Vorlagenverwaltung festgelegte Gr&ouml;&szlig;en/Maximalgr&ouml;&szlig;en 
  automatisch anpassen. Wiederum per Drop-Down-Men&uuml; k&ouml;nnen Sie aus der 
  Liste der zur Verf&uuml;gung stehenden Bilder ausw&auml;hlen, nachdem der gew&uuml;nschte 
  Verzeichnispfad ausgew&auml;hlt wurde. Weiterhin besteht die M&ouml;glichkeit, 
  das ausgesuchte Bild mit einer Verzweigung (Link) zu versehen, um bei Klick 
  darauf zu einer anderen Seite zu gelangen - w&auml;hlen Sie dazu die entsprechende 
  Option &#132;Ja&#147;. Einen Link au&szlig;erhalb Ihrer Internetpr&auml;senz 
  m&uuml;ssen Sie direkt eingeben (in der Form: &#132;http://www.domain.de/seite.html&#147;). 
  Eine Verlinkung innerhalb Ihrer Site k&ouml;nnen Sie per Drop-Down-Men&uuml; 
  ausw&auml;hlen. Best&auml;tigen Sie Ihre Auswahl mit &#132;&Uuml;bernehmen.<br>
  Beim Objekttyp &#132;Media Link&#147; geben Sie zun&auml;chst den Text des Links 
  ein. Mittels Drop-Down-Men&uuml; w&auml;hlen Sie dann Verzeichnispfad und Dateiname 
  des Bildes aus. Gegebenenfalls w&auml;hlen Sie noch die Option &#132;Link in 
  neuem Fenster &ouml;ffnen&#147; und best&auml;tigen mit &#132;&Uuml;bernehmen&#147;.<br>
  Der Objekttyp &#132;Tabelle&#147; ben&ouml;tigt die Angabe der Zeilenzahl und 
  der Spaltenzahl, die Sie vor der Best&auml;tigung mit &#132;&Uuml;bernehmen&#147; 
  per Drop-Down-Men&uuml; angeben. Anschlie&szlig;end k&ouml;nnen Sie Text in 
  die einzelnen Tabellenzellen eingeben. Die erste Zeile der Tabelle kann als 
  &Uuml;berschrift definiert werden. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Den Objekten sind 
  jeweils die Optionen &#132;L&ouml;schen&#147;, &#132;Up&#147; und &#132;Down&#147; 
  zugeordnet. Mit &#132;L&ouml;schen&#147; entfernen Sie das zugeordnete Objekt&#147;. 
  Mit &#132;Up&#147; und &#132;Down&#147; k&ouml;nnen Sie die Reihenfolge der 
  Objekte ver&auml;ndern, wenn der editierbarer Seitenbereich mehr als nur ein 
  Objekt beinhaltet.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach allen Eingaben 
  k&ouml;nnen Sie mit &#132;zur&uuml;ck&#147; wieder zur &Uuml;bersicht der editierbare 
  Seitenbereiche der Seite gelangen. Wenn Sie auf &#132;Seitenvorschau&#147; klicken, 
  wird Ihnen das Ergebnis Ihrer Eingaben angezeigt. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Das Erscheinungsbild 
  der Objekte, z.B. Textfarbe, Textgr&ouml;&szlig;e, Ausrichtung, Freiraum um 
  Bilder etc. wird &auml;hnlich wie die Layout-Vorlagen, vom Designer festgelegt 
  bzw. verschiedene Erscheinungsbilder zur Auswahl gestellt. Aus technischen Gr&uuml;nden 
  kann diese Darstellung aber noch von der sp&auml;teren Darstellung abweichen, 
  wenn die neue Seite im Kontext von anderen Seiten angezeigt wird. Die tats&auml;chliche 
  Ansicht der Seite k&ouml;nnen Sie sp&auml;ter &uuml;ber die Vorschau der gesamten 
  Internetpr&auml;senz erhalten. Dies setzt zudem voraus, dass die Seite auch 
  von einer bestehenden Seite her zug&auml;nglich (verlinkt) ist. Dazu m&uuml;ssen 
  Sie auf einer anderen Seite eine Verzweigung (Link) auf die neue Seite legen 
  oder eine solche Verkn&uuml;pfung muss schon durch den Designer erstellt worden 
  sein.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Ordner erstellen:</b><br>
  Einen neuen Ordner erstellen Sie, indem Sie unterhalb des linken Verzeichnisbaums 
  auf &#132;Neuer Ordner&#147; klicken. Falls die Auswahl &#132;Neuer Ordner&#147; 
  nicht zu sehen ist, w&auml;hlen Sie zun&auml;chst &#132;Homepage&#147; oder 
  einen anderen Ordner, je nachdem, auf welcher Verzeichnisebene Sie den neuen 
  Ordner anlegen wollen.<br>
  Dann m&uuml;ssen Sie dem Ordner einen Namen geben. Nachdem der Ordner erstellt 
  ist, kann er im Verzeichnisbaum angew&auml;hlt werden - er ist dann farblich 
  hinterlegt - um Dateien oder weitere Ordner darin anzulegen. Der neue Ordner 
  ist dann im Verzeichnisbaum sichtbar.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>L&ouml;schen 
  von Seiten/Ordnern:<br>
  </b>W&auml;hlen Sie die entsprechende Seite oder den entsprechenden Ordner aus 
  und w&auml;hlen Sie &#132;L&ouml;schen&#147; unterhalb des Verzeichnisbaumes.<br>
  Bevor der Ordner oder die Seite gel&ouml;scht wird, m&uuml;ssen Sie den L&ouml;schvorgang 
  best&auml;tigen. </font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>&Auml;ndern 
  von Seiten/Ordner:</b><br>
  Zum Umbenennen bzw. &Auml;ndern w&auml;hlen Sie die gew&uuml;nschte Seite bzw. 
  den gew&uuml;nschten Ordner aus und klicken auf &#132;&Auml;ndern&#147;. Bei 
  Seiten k&ouml;nnen Sie neben dem Seitennamen auch den Dateinamen sowie die Zuordnung 
  der Layout-Vorlage &auml;ndern. Sie k&ouml;nnen den Seitennamen und den Dateinamen 
  einer Seite &auml;ndern, sowie eine Kopie einer Seite anlegen bzw. eine Seite 
  in einen anderen Ordner verschieben, indem Sie die Seite anw&auml;hlen und dann 
  auf den Button &#132;&Auml;ndern&#147; unterhalb des Verzeichnisbaums dr&uuml;cken.<br>
  Wenn Sie den Namen bzw. den Dateinamen der Seite &auml;ndern wollen, geben Sie 
  die &Auml;nderung ein und klicken auf &#132;&Uuml;bernehmen&#147;. Wenn Sie 
  eine Kopie erstellen wollen, dann klicken Sie auf &#132;Eine Kopie dieser Seite 
  erstellen&#147;. Wenn Sie die Seite in einen anderen Ordner verschieben wollen, 
  dann w&auml;hlen Sie den Zielordner aus dem Drop-Down-Men&uuml; und best&auml;tigen 
  Sie mit &#132;&Uuml;bernehmen&#147;.<br>
  Interne Links auf eine Seite werden beim n&auml;chsten Publizieren automatisch 
  angepasst. Links in den Layoutvorlagen (z.B. in der Men&uuml;f&uuml;hrung) k&ouml;nnen 
  nicht angepasst werden - eine so verlinkte Seite ist unter neuem Dateinamen 
  dann nicht mehr zug&auml;nglich.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><br>
  <b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b> </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b><font size="3"><br>
  <a name="medien"></a>Medien:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Medien sind Inhalte 
  verschiedener Art, die Sie auf Ihrer Pr&auml;senz anbieten m&ouml;chten. In 
  erster Linie werden dies Bilder sein, die Sie beim Editieren einpflegen. M&ouml;glich 
  sind aber auch Dateien, die Sie den Besuchern Ihrer Website zur Anzeige oder 
  zum Download anbieten, z.B. PDF-Files oder Word-Dokumente. Musik oder Videos 
  sind weitere m&ouml;gliche Medieninhalte. Medien lassen sich auch zur besseren 
  &Uuml;bersicht in Ordnern gruppieren. Sie k&ouml;nnen unter diesem Men&uuml;punkt 
  Medien in die Mediendatenbank einf&uuml;gen und auch Bilder im JPG-Format rudiment&auml;r 
  bearbeiten. Bilddateien k&ouml;nnen neben dem JPG-Format auch im GIF-Format 
  vorliegen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Medien auf den 
  Server spielen:<br>
  </b>W&auml;hlen Sie die Funktion &#132;Hinzuf&uuml;gen&#147; unterhalb des Verzeichnisbaums. 
  Mittels &#132;Durchsuchen&#147; suchen Sie die lokale Datei auf Ihrem PC um 
  Sie dann mit &#132;&Uuml;bernehmen&#147; auf den Server zu spielen bzw. in die 
  Mediendatenbank einzuf&uuml;gen. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nachdem Sie auf 
  &#132;Durchsuchen&#147; geklickt haben, sollte sich auf Ihrem PC eine Dateiauswahlbox 
  &ouml;ffnen, in der sie die gew&uuml;nschte Datei ausw&auml;hlen. Diesen Vorgang 
  k&ouml;nnen Sie noch zweimal wiederholen - es sind bis zu drei sogenannte Uploads 
  auf einmal m&ouml;glich.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Den Vorgang des 
  Aufspielens (Upload) starten Sie durch klicken auf &#132;&Uuml;bernehmen&#147;. 
  Haben Sie Geduld, bis der &Uuml;bertragungsvorgang abgeschlossen ist - dies 
  kann je nach Dateigr&ouml;&szlig;e und Verbindungsgeschwindigkeit einige Zeit 
  dauern. Diesen Vorgang k&ouml;nnen Sie beliebig oft wiederholen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Bilder (und andere 
  Mediendaten) sollten in einer Internet gerechten Form vorliegen, d.h. die Dateien 
  sollten nicht zu gro&szlig; sein, um lange Ladezeiten zu vermeiden. Bilder sollten 
  in komprimierter Form im jpg- oder gif-Format verwendet werden und je nach Bildabmessung 
  nicht gr&ouml;&szlig;er als maximal ca. 50-100 Kilobyte sein.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Falls Sie Daten 
  in gepackter Form (d.h. mehrere Dateien in einem Archiv zusammengefasst) hochladen, 
  k&ouml;nnen Sie durch die entsprechende Option die Dateien automatisch entpacken 
  lassen.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Mediendateien 
  l&ouml;schen:<br>
  </b>Mediendaten k&ouml;nnen Sie l&ouml;schen, indem Sie die Datei anklicken 
  - sie wird dann farblich hinterlegt - und dann die &#132;L&ouml;schen&#147;-Funktion 
  unterhalb des Verzeichnisbaumes anw&auml;hlen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Bevor die Mediendatei 
  endg&uuml;ltig gel&ouml;scht wird, werden Sie zur Best&auml;tigung des L&ouml;schvorgangs 
  aufgefordert.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>JPG-Bilder bearbeiten</b>:</font><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><br>
  Bilddateien im jpg-Format k&ouml;nnen Sie bearbeiten (Ausschnittanpassung, Skalierung), 
  indem Sie im Verzeichnisbaum auf das Bild klicken. Das Bild erscheint in einem 
  Bearbeitungsfenster.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Dort k&ouml;nnen 
  Sie einen Bildausschnitt bestimmen und es auf die gew&uuml;nschte Gr&ouml;&szlig;e 
  skalieren.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Durch Eingabe der 
  Zielbild H&ouml;he und Breite legen Sie die Gr&ouml;&szlig;e des neuen (bearbeiteten) 
  Bildes sowie dadurch auch die Proportion des Bildausschnittes fest.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Den Bildausschnitt 
  k&ouml;nnen Sie mit den vier Pfeiltasten &uuml;ber das Ursprungsbild bewegen. 
  Den Ausschnitt k&ouml;nnen Sie mit den Buttons &#132;gr&ouml;&szlig;er&#147; 
  oder &#132;kleiner&#147; ver&auml;ndern. Die Schrittweite der Bewegung bzw. 
  den Grad der Skalierung legen Sie durch den Wert in der Box unterhalb des Bildes 
  fest.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Das Ergebnis k&ouml;nnen 
  Sie sich durch Anwahl des &#132;Vorschau&#147;-Buttons ansehen.<br>
  Wenn Ihnen das Ergebnis zusagt, wird das Bild durch das bearbeitete ersetzt, 
  indem Sie &#132;Speichern&#147; anw&auml;hlen. Das Ausgangsbild wird dabei &uuml;berschrieben 
  - dieser Vorgang kann nicht widerrufen werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">In welcher Gr&ouml;&szlig;e 
  das Bild sp&auml;ter tats&auml;chlich in Ihrer Webpr&auml;senz erscheint h&auml;ngt 
  davon ab, wie der Objekttyp &#132;Bild&#147; bzw. &#132;Bild mit Autogr&ouml;&szlig;e&#147; 
  in der Layoutvorlage bzw. der Objektvorlage definiert wurde. Damit ein Bild 
  in das Layout passt, kann z.B. festgelegt sein, dass es 200 Pixel breit ist. 
  Es wird dann sp&auml;ter vom Browser in dieser Breite angezeigt, auch wenn Sie 
  das Bild in einer anderen Breite speichern.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="vorschau"></a>Vorschau:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">In der Vorschau 
  k&ouml;nnen Sie sich die &Auml;nderungen die Sie an Ihrer Internetpr&auml;senz 
  vorgenommen haben anschauen, ohne dass die Besucher Ihrer Website die &Auml;nderungen 
  schon sehen w&uuml;rden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Dazu werden Ihre 
  Daten zuerst auf einen Demo-Server gespielt, indem Sie auf &#132;Publizieren 
  auf Demo-Server&#147; klicken. Damit k&ouml;nnen Sie &uuml;berpr&uuml;fen, ob 
  Ihre &Auml;nderungen zufriedenstellend aussehen und gegebenenfalls noch Nachbesserungen 
  durchf&uuml;hren.<br>
  <br>
  Achten Sie beim Aufrufen dieser Funktionen darauf, erst die Beendigung des Vorgangs 
  abzuwarten, bevor Sie einen anderen Punkt aufrufen. Diese Zusammenstellung der 
  Seiten kann einige Zeit dauern. Schlie&szlig;en Sie w&auml;hrend dieser Zeit 
  nicht das Browserfenster!<br>
  <br>
  Nun k&ouml;nnen Sie durch Anwahl von &#132;Vorschauansicht der Website&#147; 
  Ihre Website auf dem Demo-Server anschauen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Damit Ihre Seiten 
  angezeigt werden, muss die Indexseite (index.html) als Startseite der Internetpr&auml;senz 
  vorhanden sein - entweder durch Sie oder den Designer der Layoutvorlagen angelegt.<br>
  Weiterhin m&uuml;ssen die Seiten durch Links von der Indexseite oder Folgeseiten 
  erreichbar gemacht worden sein. Falls Sie Ihre Website nicht komplett und ausschlie&szlig;lich 
  mit Pagix selbst aufbauen, sollte dies schon f&uuml;r Sie erledigt worden sein.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Halten Sie sich 
  bitte an die Reihenfolge, erst auf dem Demo-Server zu publizieren und anschlie&szlig;end 
  die &#132;Vorschauansicht ihrer Website&#147; anzuw&auml;hlen. Nur so ist gew&auml;hrleistet, 
  dass Sie auch die aktuelle Version Ihrer Website in der Vorschau sehen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn alle &Auml;nderungen 
  zufriedenstellend sind, k&ouml;nnen Sie die Site mit &#132;Speichern&#147; im 
  Hauptmen&uuml; auf dem eigentlichen Server der &Ouml;ffentlichkeit zug&auml;nglich 
  machen.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="speichern"></a>Speichern:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Mit &#132;Speichern&#147; 
  &uuml;bertragen Sie Ihre &Auml;nderungen auf Ihre eigentliche Website. Danach 
  sind alle von Ihnen gemachten &Auml;nderungen f&uuml;r die Besucher Ihres Auftritts 
  verf&uuml;gbar.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Sie sollten daher, 
  bevor Sie diese Funktion anw&auml;hlen, mit der &#132;Vorschau&#147; aus dem 
  Hauptmen&uuml; &uuml;berpr&uuml;fen, ob alle &Auml;nderungen zufriedenstellend 
  sind und ob, z.B. nach dem L&ouml;schen von Seiten oder Inhalten, noch alle 
  Seiten erreichbar sind und keine Verkn&uuml;pfungen zu Seiten bestehen, die 
  nicht oder nicht mehr existieren.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Auch die Medieninhalte 
  werden erst zu diesem Zeitpunkt verf&uuml;gbar gemacht, d.h. auf den Server 
  &uuml;bertragen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Warten Sie nach 
  Aufruf der Speicher-Funktion durch &#132;Start&#147; unbedingt auf die Mitteilung 
  &uuml;ber den erfolgreichen Abschluss der &Uuml;bertragung. Bei unvollst&auml;ndiger 
  &Uuml;bertragung kann es zu unvorhersehbaren Fehlern auf Ihrer Website kommen, 
  die f&uuml;r alle Besucher sichtbar sind.</font></p>
<font face="Verdana, Arial, Helvetica, sans-serif" size="1">Falls Sie trotzdem 
  unterbrochen haben, sollten Sie den Speichervorgang erneut starten und auf die 
  Best&auml;tigung der &Uuml;bertragung warten. Die bei der Unterbrechung eventuell 
  entstandenen Fehler werden dadurch &uuml;berschrieben.</font><br>

<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="module"></a>Module:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Hier befinden sich 
  Zusatzfunktionen, die Sie zus&auml;tzlich zu den Basisfunktionalit&auml;ten 
  bei net erwerben k&ouml;nnen. F&uuml;r die einzelnen Module erhalten Sie 
  gesondert eine Anleitung zur Bedienung.<br>
  <br>
  Daher werden diese Punkte hier nicht im einzelnen besprochen.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="verwalten"></a>Verwalten:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Unter Verwalten 
  werden die Layout-Vorlagen und editierbaren Seitenbereiche vom Designer verwaltet 
  und zusammengef&uuml;hrt. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Den Platzhaltern 
  in den Layout-Vorlagen werden hier editierbare Seitenbereiche zugeordnet. Au&szlig;erdem 
  werden diese konfiguriert indem Anzahl und Typ der Objekte eines editierbaren 
  Seitenbereiches festgelegt werden. Die Vorlagen f&uuml;r die Seiten und die 
  Konfigurationen der Objekttypen werden vom Designer auf dem Server bereitgestellt.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Editierbaren 
  Seitenbereich anlegen</b>:<br>
  Wenn Sie &#132;Verwalten&#147; aufrufen, erhalten Sie eine &Uuml;bersicht &uuml;ber 
  die zur Verf&uuml;gung stehenden Layout-Vorlagen. Neben dem Dateinamen wird 
  auch angezeigt, ob bereits editierbare Seitenbereiche erstellt wurden. Ohne 
  die Definition der editierbaren Seitenbereiche k&ouml;nnen die Layout-Vorlagen 
  nicht verwendet werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Klicken Sie auf 
  den Namen der Vorlage. Nun k&ouml;nnen Sie editierbare Seitenbereiche in der 
  Vorlage anlegen. Weiterhin haben Sie die M&ouml;glichkeit, die Vorlage umzubenennen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zum Umbenennen 
  geben Sie den gew&uuml;nschten neuen Namen ein und best&auml;tigen Sie - wenn 
  Sie nun zur &Uuml;bersicht der Layout-Vorlagen zur&uuml;ckgehen, wird die Vorlage 
  unter dem neuen Namen angezeigt.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zum Anlegen eines 
  editierbaren Seitenbereichs klicken Sie auf &#132;Neuer Seitenbereich&#147;. 
  Im folgenden Dialog geben Sie zun&auml;chst unter &#132;Seitenbereich&#147; 
  die genaue Bezeichnung des Platzhalters ein, wie er in der html-Vorlage benannt 
  ist. Wenn die Seitenbereiche noch nicht angelegt wurden, erfahren Sie die Bezeichnung 
  in Ihren Unterlagen oder vom Designer. Weiterhin geben Sie die maximale Anzahl 
  der m&ouml;glichen Objekte des Seitenbereichs an - wenn Sie &#132;0&#147; angeben, 
  bleibt die Anzahl undefiniert. Falls Sie den Objekttyp &#132;Bild mit Auto-Gr&ouml;&szlig;e&#147; 
  verwenden wollen, geben Sie hier die gew&uuml;nschte Bildgr&ouml;&szlig;e bzw. 
  maximale Bildgr&ouml;&szlig;e an.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach der Best&auml;tigung 
  k&ouml;nnen Sie nun die einzelnen Objekte des Seitenbereichs definieren. W&auml;hlen 
  Sie dazu aus dem Drop-Down-Men&uuml; den gew&uuml;nschten Objekttyp und klicken 
  dann auf &#132;&Uuml;bernehmen&#147;. Je mehr Objekttypen erm&ouml;glicht werden, 
  desto flexibler l&auml;&szlig;t sich der editierbare Seitenbereich sp&auml;ter 
  gestalten. Au&szlig;erdem k&ouml;nnen bei sp&auml;teren &Auml;nderungen an der 
  Objektdefinition eines editierbaren Bereiches gegebenenfalls Datenverluste auftreten, 
  wenn schon Seiten auf dieser Layoutvorlage beruhen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Das neue Objekt 
  erscheint in einer Liste. Hier m&uuml;ssen Sie nun angeben, wie oft ein Objekt 
  dieses Objekttyps in dem editierbaren Seitenbereich maximal vorkommen soll. 
  Au&szlig;erdem m&uuml;ssen Sie aus dem Drop-Down-Men&uuml; &#132;Vorlage&#147; 
  die gew&uuml;nschte Objekt-Vorlage dem Objekt zuordnen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">In den Objekt-Vorlagen 
  hat der Designer das Erscheinungsbild f&uuml;r die Objekte festgelegt, z.B. 
  die Farbe, Gr&ouml;&szlig;e und Schriftart von Text, oder die Gr&ouml;&szlig;e 
  und den Freistellraum von Bildern.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach dieser Zuordnung 
  k&ouml;nnen Sie weitere Objekttypen anlegen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Mit &#132;zur&uuml;ck&#147; 
  kommen Sie auf die &Uuml;bersicht der editierbaren Seitenbereiche. Auch hier 
  k&ouml;nnen Sie nun weitere editierbare Seitenbereiche - wenn in der Vorlage 
  so vorgesehen - nach dem geschilderten Schema definieren. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach diesen Definitionen 
  k&ouml;nnen auf Basis dieser Vorlage Seiten erstellt und mit Inhalt gef&uuml;llt 
  werden.</font><br>
</p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><b>Editierbare 
  Seitenbereiche bearbeiten:<br>
  </b>Klicken Sie auf den Namen der Vorlage. Nun k&ouml;nnen Sie weitere editierbare 
  Seitenbereiche anlegen, sowie bestehende editierbare Seitenbereiche und Objekte 
  l&ouml;schen oder bearbeiten.<br>
  </font><font face="Verdana, Arial, Helvetica, sans-serif" size="1">&Auml;nderungen 
  sind dabei jeweils mit dem &#132;&Uuml;bernehmen-Button&#147; zu best&auml;tigen, 
  damit sie &uuml;bernommen werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn Sie Layout-Vorlagen 
  &auml;ndern, auf deren Basis bereits Seiten erstellt wurden, werden diese Seiten 
  beim n&auml;chsten Uploadvorgang bzw. Publizieren mit den neuen Definitionen 
  erstellt. Daher kann es zu Datenverlusten oder unbeabsichtigten &Auml;nderungen 
  kommen! Wie sich solche &Auml;nderungen auswirken, k&ouml;nnen Sie vor dem Speichern 
  auf den eigentlichen WWW-Server mittels der Vorschaufunktion &uuml;berpr&uuml;fen, 
  ohne dass die Besucher Ihrer Website etwas davon sehen k&ouml;nnen.</font><br>
  <br>
  <b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b> </p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="benutzer"></a>Benutzer:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Hier k&ouml;nnen 
  Sie neue Benutzer anlegen, l&ouml;schen oder die Berechtigungen der einzelnen 
  Benutzer &auml;ndern.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Pagix erlaubt es, 
  verschiedene Benutzer mit unterschiedlichen Berechtigungen einzurichten.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">So k&ouml;nnen 
  beispielsweise &Auml;nderungen von einem Mitarbeiter durchgef&uuml;hrt werden, 
  der aber keine Berechtigung hat, auf den Zielserver zu publizieren. Dies kann 
  dann nur ein Benutzer, der dazu die Berechtigung hat und die &Auml;nderungen 
  vor der Freischaltung der Website auf dem Zielserver zuvor auf dem Demoserver 
  kontrollieren kann (4-Augen-Prinzip).</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nach Auswahl des 
  Men&uuml;punktes &#132;Benutzer&#147; erhalten Sie eine &Uuml;bersicht &uuml;ber 
  alle eingetragenen Benutzer.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn Sie einen 
  Benutzer l&ouml;schen wollen, dann dr&uuml;cken Sie den entsprechenden Button 
  hinter dem Benutzernamen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die vergebenen 
  Benutzerrechte k&ouml;nnen Sie sich anschauen bzw. &Auml;nderungen an den Benutzerrechten 
  k&ouml;nnen Sie durchf&uuml;hren, wenn Sie auf den Editieren-Button hinter dem 
  Benutzernamen klicken.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Einen neuen Benutzer 
  richten Sie ein, indem Sie mit dem Mauszeiger auf &#132;Neuen Benutzer anlegen&#147; 
  dr&uuml;cken. Es erscheint eine Eingabemaske, in die Sie den Benutzernamen, 
  dass Passwort sowie die zu vergebenden Rechte eintragen. Sie k&ouml;nnen nur 
  solche Rechte vergeben, die Sie selbst besitzen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Schlie&szlig;en 
  Sie die Eingabe mit &#132;&Uuml;bernehmen&#147; ab. Mit &#132;zur&uuml;ck&#147; 
  gelangen Sie wieder zur &Uuml;bersicht, in der der neue Benutzer nun auch eingetragen 
  ist.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn sich jemand 
  unter dem neuen Benutzernamen anmeldet, kann er nur die Funktionen sehen oder 
  benutzen, die f&uuml;r ihn freigegeben sind.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
  <a name="einstellungen"></a>Optionen:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Unter Optionen 
  legen Sie die Internetadressen (URL) Ihrer Server fest. Pagix ist an keinen 
  bestimmten Server gebunden, sodass sie Ihre Website prinzipiell auf jedem beliebigen 
  Server vorhalten lassen k&ouml;nnen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Der Demoserver 
  ist der Server, auf dem Sie sich &Auml;nderungen anschauen k&ouml;nnen, ohne 
  dass andere Nutzer des Internets dies sehen k&ouml;nnen. Hier k&ouml;nnen Sie 
  Ihre Eingaben oder die Eingaben Ihrer Mitarbeiter vor der Ver&ouml;ffentlichung 
  und Freischaltung auf Fehler &uuml;berpr&uuml;fen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die Ziel-URL bezeichnet 
  die Adresse, unter der Ihre Site f&uuml;r alle Nutzer des Internets sichtbar 
  ist.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die Adressen werden 
  Sie wahrscheinlich nur einmal einstellen bzw. durch net einstellen lassen. 
  Ein &Auml;nderungsbedarf besteht nur, wenn Ihre Internetpr&auml;senz auf einen 
  anderen Server umzieht.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="3"><b><br>
  <a name="hilfe"></a>Hilfe:</b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die Bedienung von 
  Pagix ist schon nach kurzer Zeit intuitiv. Strukturierte Men&uuml;s und erkl&auml;rende 
  Texte sollen den Workflow m&ouml;glichst verst&auml;ndlich abbilden. Die &uuml;bergreifende 
  Online-Hilfe mit der Erkl&auml;rung von wichtigen Begriffen, der Beschreibung 
  der Men&uuml;punkte und des Workflows, ist &uuml;ber das Hauptmen&uuml; zug&auml;nglich. 
  Daneben sind an verschiedenen Stellen innerhalb der Bedienungsseiten Kontextsensitive 
  Hilfen vorgesehen, erkennbar an den Fragezeichen neben den Funktionen, die Hilfestellung 
  bei der Bedienung der konkreten Funktion geben.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<hr>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><font size="4"><a name="arbeitsschritte"></a>Typische 
  Arbeitsschritte:</font></font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><a name="arbeitsschritte_1"></a>Eine 
  bestehende Seite bearbeiten:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Eine bestehende 
  Seite k&ouml;nnen Sie bearbeiten, indem Sie auf &#132;Editieren&#147; klicken 
  und dann im Verzeichnisbaum auf der linken Seite die gew&uuml;nschte Seite ausw&auml;hlen.<br>
  Klicken Sie auf den Seitenbereich, in dem Sie die &Auml;nderungen vornehmen 
  wollen. Sie k&ouml;nnen sich durch die Seitenvorschau zuvor einen &Uuml;berblick 
  &uuml;ber zu &auml;ndernde Seite verschaffen.<br>
  Scrollen Sie zu dem Objekt, welches Sie &auml;ndern wollen und f&uuml;hren Sie 
  die gew&uuml;nschten &Auml;nderungen durch. Beispielsweise k&ouml;nnen Sie einen 
  Text ver&auml;ndern oder erg&auml;nzen, ein Bild austauschen, einen Link aktualisieren 
  oder die Reihenfolge der Objekte &auml;ndern. Denken Sie daran, Ihre &Auml;nderungen 
  mit dem &#132;&Uuml;bernehmen&#147;-Button zu best&auml;tigen.<br>
  Nat&uuml;rlich k&ouml;nnen Sie auch neue Objekte hinzuf&uuml;gen. W&auml;hlen 
  Sie dazu &#132;Neues Objekt einf&uuml;gen&#147;, bestimmen Sie den Objekttyp 
  und geben Sie den Inhalt ein. Sie k&ouml;nnen nur solche Objekte einf&uuml;gen, 
  die unter &#132;Verwalten&#147; f&uuml;r den jeweiligen editierbaren Seitenbereich 
  freigeschaltet wurden. Gegebenenfalls m&uuml;ssen Sie also unter &#132;Verwalten&#147; 
  den gew&uuml;nschten Objekttyp f&uuml;r den gew&uuml;nschten editierbaren Seitenbereich 
  aktivieren.<br>
  Mittels der Seitenvorschau k&ouml;nnen Sie sich die Auswirkungen Ihrer &Auml;nderungen 
  jeweils anschauen und gegebenenfalls noch Modifikationen vornehmen. Falls Sie 
  interne Links &auml;ndern, sollten Sie darauf achten, das weiterhin alle gew&uuml;nschten 
  Seiten zug&auml;nglich bleiben und keine Seiten entstehen, die von keinem Link 
  mehr erreicht werden und damit nicht mehr aufgerufen werden k&ouml;nnen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn alle &Auml;nderungen 
  zu Ihrer Zufriedenheit ausgefallen sind, k&ouml;nnen Sie die Seite publizieren. 
  Ver&ouml;ffentlichen Sie Ihre Site - und damit auch die ge&auml;nderte Seite 
  mit allen zugeh&ouml;rigen Daten - zun&auml;chst auf dem Demoserver mittels 
  &#132;Vorschau&#147; und schauen sich die Seite innerhalb der Site an. So k&ouml;nnen 
  Sie z.B. auch die ordnungsgem&auml;&szlig;e Verlinkung innerhalb der Site &uuml;berpr&uuml;fen. 
  Wenn alles in Ordnung ist, k&ouml;nnen Sie die Site mit allen Seiten dann durch 
  &#132;Speichern&#147; auf den Server spielen und die &Auml;nderungen damit f&uuml;r 
  alle Besucher Ihrer Website zug&auml;nglich machen.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><a name="arbeitsschritte_2"></a>Eine 
  neue Seite anlegen und einen internen Link darauf einrichten:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Mit Pagix k&ouml;nnen 
  Sie Ihre Webpr&auml;senz in technischer Hinsicht um eine nahezu beliebige Anzahl 
  von Seiten erweitern, beispielsweise um eine Produkt&uuml;bersicht um ein Produkt 
  zu erweitern und auf einer neuen Seite eine detaillierte Produktbeschreibung 
  anzulegen.<br>
  Um eine neue Seite in Ihrer Webpr&auml;senz anzulegen, die von einer bestehenden 
  Seite zug&auml;nglich (verlinkt) ist, gehen Sie in zwei Schritten vor:</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zun&auml;chst erstellen 
  Sie die neue Seite - z.B. die Beschreibung eines neuen Produktes oder einer 
  Dienstleistung.<br>
  Dann legen Sie auf der &uuml;bergeordneten Seite - z.B. eine Produkt&uuml;bersicht 
  oder eine Dienstleistungs&uuml;bersicht - einen Link (Verkn&uuml;pfung) auf 
  die neue Seite.<br>
  <br>
  Um eine neue Seite anzulegen, gehen Sie in den Bereich &#132;Editieren&#147;. 
  Klicken Sie auf &#132;Neue Seite&#147; unterhalb des Dateibaums.<br>
  W&auml;hlen Sie nun den Seitentyp - normalerweise den Typ &#132;Webseite&#147; 
  - und best&auml;tigen Sie. <br>
  Geben Sie der neuen Seite einen Namen und best&auml;tigen Sie. Achten Sie darauf, 
  keine bestehende Datei zu &uuml;berschreiben.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Aus Gr&uuml;nden 
  der &Uuml;bersichtlichkeit haben Sie die M&ouml;glichkeit, Ihre Site durch Ordner 
  zu strukturieren, indem Sie beispielsweise einen Ordner &#132;Produkte&#147; 
  anlegen, in dem Sie dann die einzelnen Seiten mit den Produktbeschreibungen 
  speichern.<br>
  Gegebenenfalls k&ouml;nnen Sie noch die Seiten-URL &auml;ndern, allerdings sollte 
  der Seitenname aus Gr&uuml;nden der &Uuml;bersichtlichkeit nur in Ausnahmef&auml;llen 
  von der Seiten-URL abweichen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nun w&auml;hlen 
  Sie die Layoutvorlage f&uuml;r Ihre neue Seite aus. Durch die Layoutvorlage 
  (Template) wird das Erscheinungsbild Ihrer Seite im Wesentlichen festgelegt 
  - z.B. in diesem Fall die Layoutvorlage &#132;tpl_produkte.html&#147; als Vorlage 
  f&uuml;r Seiten mit Produktbeschreibungen. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nachdem Sie mit 
  &#132;&Uuml;bernehmen&#147; best&auml;tigt haben, wird die neue Seite angelegt 
  und im Verzeichnisbaum links angezeigt. Sie k&ouml;nnen die neue Seite noch 
  in einen anderen Ordner verschieben, beispielweise wenn Sie alle Produktbeschreibungen 
  in einem Ordner zusammenfassen wollen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Klicken Sie nun 
  auf den Seitennamen, um Inhalt einzupflegen. Es erscheint eine &Uuml;bersicht 
  &uuml;ber die zur Verf&uuml;gung stehenden Seitenbereiche, die mit Inhalt gef&uuml;llt 
  werden k&ouml;nnen. Au&szlig;erdem besteht die M&ouml;glichkeit, sich &uuml;ber 
  die Seitenvorschau zun&auml;chst einen &Uuml;berblick &uuml;ber das vorgegebene 
  Seitenlayout zu verschaffen. Mit der Seitenvorschau k&ouml;nnen Sie auch w&auml;hrend 
  des Einpflegens von Inhalt immer kontrollieren, ob Ihre Eingaben in das Layout 
  passen und Ihren Vorstellungen entsprechen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">W&auml;hlen Sie 
  nun den editierbaren Seitenbereich, in den Sie Daten eingeben wollen - wenn 
  Sie die Dateneingabe in diesen Seitenbereich abgeschlossen haben, kehren Sie 
  an diese Stelle zur&uuml;ck, um weitere editierbare Seitenbereiche mit Inhalt 
  zu f&uuml;llen. </font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Sie gelangen zur 
  &Uuml;bersicht des angew&auml;hlten editierbaren Seitenbereichs, der noch leer 
  ist. Ein neues Objekt f&uuml;gen Sie ein, indem Sie den gew&uuml;nschten Objekttyp 
  im Drop-Down-Men&uuml; aus den f&uuml;r den Seitenbereich vorgesehenen Objekttypen 
  ausw&auml;hlen und mit &#132;&Uuml;bernehmen&#147; best&auml;tigen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Je nach gew&auml;hltem 
  Objekttyp erscheint eine spezielle Eingabemaske, mit der Sie den Inhalt bestimmen. 
  In unserem Beispiel k&ouml;nnen Sie Text in das vorgesehene Feld eintragen und 
  mit &Uuml;bernehmen best&auml;tigen. Anschlie&szlig;end k&ouml;nnen Sie wieder 
  ein neues Objekt anlegen und ebenso mit Inhalt f&uuml;llen. F&uuml;r eine Produktbeschreibung 
  k&ouml;nnten Sie beispielsweise f&uuml;r den editierbaren Seitenbereich ein 
  Objekt vom Typ &#132;&Uuml;berschrift&#147; f&uuml;r die Produktbezeichnung, 
  ein Objekt vom Typ Text f&uuml;r die Produktbeschreibung und ein Objekt vom 
  Typ Bild f&uuml;r eine Abbildung des Produktes zusammenstellen. Eventuell k&ouml;nnten 
  Sie noch eine Einbindung einer Word- oder PDF-Datei mit einer ausf&uuml;hrlichen 
  Produktinfo vorsehen, die der Besucher der Website sich bei Bedarf herunterladen 
  kann. Falls die gew&uuml;nschten Objekttypen f&uuml;r den editierbaren Seitenbereich 
  nicht zur Verf&uuml;gung stehen, k&ouml;nnen diese im Men&uuml;punkt &#132;Verwalten&#147; 
  dem editierbaren Seitenbereich zugeordnet werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Mit der Seitenvorschau 
  k&ouml;nnen Sie sich einen &Uuml;berblick &uuml;ber Ihre Eingaben verschaffen 
  um dann eventuell noch &Auml;nderungen oder Erg&auml;nzungen vorzunehmen. Denken 
  Sie jedoch daran, dass Mediendaten erst nach dem Publizieren auf den Demoserver 
  zur Ansicht zur Verf&uuml;gung stehen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">In einem zweiten 
  Schritt m&uuml;ssen Sie nun von einer bestehenden Seite einen Link auf die neue 
  Seite legen, damit diese auch aufgerufen werden kann.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Falls Sie sich 
  nicht mehr im Bereich &#132;Editieren&#147; befinden, rufen Sie diesen erneut 
  auf. Suchen Sie links im Verzeichnisbaum die &uuml;bergeordnete Seite, von der 
  aus Sie auf die neue Seite verlinken wollen, also beispielsweise die &Uuml;bersicht 
  &uuml;ber die Produkte.<br>
  Aktivieren Sie die Seite durch anklicken, sodass diese farbig hinterlegt erscheint 
  und eine &Uuml;bersicht &uuml;ber die editierbaren Seitenbereiche der Seite 
  sichtbar wird.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">W&auml;hlen Sie 
  den editierbaren Seitenbereich, in dem der Link auf die neue Seite gelegt werden 
  soll. Der Seitenbereich muss den Objekttyp &#132;Interner Link&#147; unterst&uuml;tzen 
  k&ouml;nnen. Gegebenenfalls m&uuml;ssen Sie im Bereich &#132;Verwalten&#147; 
  f&uuml;r den gew&uuml;nschten Seitenbereich den Objekttyp &#132;Interner Link&#147; 
  definieren, wenn dieser noch nicht vorgesehen ist.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">F&uuml;gen Sie 
  &#132;Interner Link&#147; als neues Objekt ein und best&auml;tigen Sie.<br>
  Sie erhalten eine Eingabemaske, in die Sie einen Text f&uuml;r den Link eintragen. 
  Dieser Text erscheint dann sp&auml;ter in dem Dokument (das Erscheinungsbild 
  wird in der Definition der Objektvorlage vom Designer bestimmt) und wenn Sie 
  darauf klicken wird dann sp&auml;ter die verlinkte Seite aufgerufen.<br>
  Bestimmen Sie die Seite, auf die verzweigt werden soll, indem Sie den Ordner 
  und die Linkadresse per Drop-Down-Men&uuml; anw&auml;hlen.<br>
  Weiterhin k&ouml;nnen Sie noch festlegen, ob die neue Seite in einem neuen oder 
  in dem bestehenden Browserfenster angezeigt werden soll.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Best&auml;tigen 
  Sie mit &#132;&Uuml;bernehmen&#147; und sehen Sie sich das Ergebnis per Seitenvorschau 
  an. Sie k&ouml;nnen dort durch Anwahl des Links feststellen, ob die Verlinkung 
  auf die neue Seite funktioniert.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Falls die neue 
  Seite nicht allgemein in die Men&uuml;f&uuml;hrung eingebunden ist (dies h&auml;ngt 
  von der Layoutvorlage f&uuml;r die Seite ab), m&uuml;ssen Sie auf der neuen 
  Seite auch einen Link vorsehen, der auf die verweisende Seite zur&uuml;ckf&uuml;hrt.</font><br>
</p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><a name="arbeitsschritte_3"></a>Ein 
  neues Bild einbinden:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Um ein neues Bild 
  in Ihren Internetauftritt einzubinden, m&uuml;ssen Sie das Bild zuerst in die 
  Mediendatenbank einf&uuml;gen und anschlie&szlig;end auf der gew&uuml;nschten 
  Seite einbinden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">W&auml;hlen Sie 
  den Men&uuml;punkt &#132;Medien&#147; im Hauptmen&uuml;. Auf der linken Seite 
  wird Ihnen der Inhalt Ihrer Mediendatenbank angezeigt. Mit der Funktion &#132;Hinzuf&uuml;gen&#147; 
  unterhalb des Verzeichnisbaums gelangen Sie zu einer Eingabemaske, mit deren 
  Hilfe Sie neue Mediendaten in Ihre Mediendatenbank einf&uuml;gen k&ouml;nnen.<br>
  Mittels &#132;Durchsuchen&#147; suchen Sie die Mediendatei auf Ihrem lokalen 
  Computer um Sie dann mit &#132;&Uuml;bernehmen&#147; in die Mediendatenbank 
  zu &uuml;bertragen.<br>
  Nachdem Sie auf &#132;Durchsuchen&#147; geklickt haben, sollte sich auf Ihrem 
  Computer eine Dateiauswahlbox &ouml;ffnen, in der sie die gew&uuml;nschte Datei 
  ausw&auml;hlen. In der Maske wird dann der lokale Verzeichnispfad Ihrer Mediendatei 
  auf Ihrem Rechner angezeigt. Sie k&ouml;nnen bis zu drei Mediendateien gleichzeitig 
  angeben.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Den Vorgang des 
  Aufspielens (Upload) starten Sie durch &#132;&Uuml;bernehmen&#147;. Haben Sie 
  bitte Geduld, bis der &Uuml;bertragungsvorgang abgeschlossen ist - dies kann 
  je nach Dateigr&ouml;&szlig;e und Verbindungsgeschwindigkeit einige Zeit dauern.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Ihre Bilder sollten 
  in einer Internet gerechten Form vorliegen, d.h. in einem komprimierten Format 
  wie &#132;jpg&#147; oder &#132;gif&#147; und je nach Bildabmessung in der Regel 
  nicht gr&ouml;&szlig;er als ca. 50-100 Kilobyte sein, weil die Besucher Ihrer 
  Website ansonsten durch zu lange Ladezeiten beeintr&auml;chtigt werden k&ouml;nnten.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Bilddateien im 
  jpg-Format k&ouml;nnen Sie in Pagix zur Anpassung an Ihr Layout rudiment&auml;r 
  bearbeiten. Sie k&ouml;nnen einen Ausschnitt eines bestehenden Bildes bestimmen 
  und diesen Ausschnitt auf eine bestimmte Bildgr&ouml;&szlig;e skalieren.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Indem Sie im Verzeichnisbaum 
  auf das Bild klicken rufen Sie die Bildbearbeitungsfunktion auf - dies funktioniert 
  nur bei Bildern im jpg-Format.<br>
  Das urspr&uuml;ngliche Bild erscheint in einem Bearbeitungsfenster. Dort k&ouml;nnen 
  Sie es auf die gew&uuml;nschte Gr&ouml;&szlig;e skalieren. Durch Eingabe der 
  Zielbild H&ouml;he und Breite sowie durch Anwahl der Buttons &#132;gr&ouml;&szlig;er&#147; 
  oder &#132;kleiner&#147; legen Sie den gew&uuml;nschte Ausschnitt bzw. die gew&uuml;nschte 
  Ausschnittsgr&ouml;&szlig;e fest. Das Auswahlfenster bewegen Sie mit den vier 
  Buttons in der eingestellten Schrittweite.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Die sp&auml;tere 
  Darstellung des Bildes ist allerdings nicht unbedingt von der hier festgelegten 
  Gr&ouml;&szlig;e abh&auml;ngig. In der Definition der Objekttypen f&uuml;r die 
  editierbaren Seitenbereiche kann n&auml;mlich festgelegt werden, in welcher 
  Gr&ouml;&szlig;e ein Bild tats&auml;chlich erscheint (Objekttyp &#132;Bild mit 
  Autogr&ouml;&szlig;e&#147;). Auch beim Objekttyp &#132;Bild&#147; kann je nach 
  Festlegung der Vorlagen f&uuml;r die Objekttypen eine Skalierung der Bilddarstellung 
  angegeben werden, so dass sich die Angabe der Bildgr&ouml;&szlig;e bei der Bildbearbeitung 
  nur hinsichtlich der Bildqualit&auml;t, aber nicht hinsichtlich der tats&auml;chlich 
  dargestellten Bildgr&ouml;&szlig;e auswirkt. Denkbar sind sowohl feste Gr&ouml;&szlig;enangaben 
  als auch relative Gr&ouml;&szlig;en. Diese L&ouml;sung ist deshalb gew&auml;hlt, 
  damit der Designer die Bildeinstellung optimal in die Layoutvorlagen integrieren 
  kann und ein Layout nicht durch falsche Bildgr&ouml;&szlig;en zerst&ouml;rt 
  werden kann.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Das Ergebnis k&ouml;nnen 
  Sie sich durch klicken auf die &#132;Vorschau&#147; ansehen. Wenn Ihnen das 
  Ergebnis zusagt, wird das urspr&uuml;ngliche Bild durch das bearbeitete ersetzt, 
  indem Sie auf &#132;Speichern&#147; klicken. Dieser Schritt ist nicht r&uuml;ckg&auml;ngig 
  zu machen - gegebenenfalls m&uuml;ssen Sie das urspr&uuml;ngliche Bild nocheinmal 
  von Ihrem lokalen Rechner in die Mediendatenbank &uuml;bertragen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nachdem Sie das 
  Bild in die Mediendatenbank eingef&uuml;gt und gegebenenfalls bearbeitet haben, 
  k&ouml;nnen Sie es auf der gew&uuml;nschten Seite in Ihrer Website einbinden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Rufen Sie die Seite 
  im Bereich &#132;Editieren&#147; auf und w&auml;hlen den Seitenbereich, in den 
  das Bild eingebunden werden soll.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Erstellen Sie nun 
  ein neues Objekt vom Typ &#132;Bild&#147; oder &#132;Bild mit Autogr&ouml;&szlig;e&#147; 
  und best&auml;tigen Sie. Per Drop-Down-Men&uuml; k&ouml;nnen Sie nun das Bild 
  (innerhalb des zugeh&ouml;rigen Verzeichnisses) bestimmen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Optional haben 
  Sie noch die M&ouml;glichkeit, das Bild mit einem internen oder externen Link 
  zu versehen. Beim internen Link w&auml;hlen Sie per Drop-Down-Men&uuml; aus 
  der Liste der Seiten Ihrer Site. Beim externen Link geben Sie bitte die vollst&auml;ndige 
  Adresse der zu verlinkenden Seite ein (http:/www. ...). Zus&auml;tzlich k&ouml;nnen 
  Sie die Darstellung der verlinkten Seite in einem neuen Fenster erzwingen, was 
  sich insbesondere bei externen Links anbietet.</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><a name="arbeitsschritte_4"></a>Eine 
  Word-, Exel-, Powerpoint- oder PDF-Datei einbinden:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Um den Besuchern 
  Ihrer Website weitergehende Informationen anzubieten, bieten sich oft fertige 
  Dokumente an, die mit Word, Exel oder Powerpoint erstellt wurden. Unabh&auml;ngig 
  von den Dateiformaten des Microsoft-Office-Paketes hat sich gerade das PDF-Format 
  als ein Standard zur Darstellung und Weitergabe von Dokumenten verschiedener 
  Art etabliert, welches mit dem kostenlosen Acrobat Reader auf nahezu jedem Rechner 
  gelesen werden kann.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Sie k&ouml;nnen 
  mit Pagix Dokumente der angegebenen Typen auf Ihrer Website verlinken und zum 
  Download anbieten. In den meisten F&auml;llen werden die Browser der Besucher 
  Ihrer Website die Dokumente durch integrierte Funktionen direkt anzeigen k&ouml;nnen. 
  Falls dies nicht m&ouml;glich ist, besteht immer noch die M&ouml;glichkeit die 
  Dateien trotzdem zu laden und mit externen Programmen anzuzeigen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Um die Dokumente 
  einzubinden sind - &auml;hnlich wie bei Bildern - zwei Arbeitsschritte notwendig:</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zun&auml;chst spielen 
  Sie die Dokumente in die Mediendatenbank auf dem Server und in einem zweiten 
  Schritt binden Sie die Dokumente auf Ihrer Website ein, indem Sie einen Link 
  darauf legen.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Zum Einf&uuml;gen 
  in die Mediendatenbank w&auml;hlen Sie das Men&uuml; &#132;Medien&#147; und 
  klicken auf &#132;Hinzuf&uuml;gen&#147;. Mittels &#132;Durchsuchen&#147; k&ouml;nnen 
  Sie auf Ihrem lokalen Rechner die gew&uuml;nschte Datei ausw&auml;hlen. Ihr 
  Rechner wird Ihnen dazu Ihre gewohnte Dateiauswahlbox anbieten. Durch bet&auml;tigen 
  des Buttons &#132;&Uuml;bernehmen&#147; wird der &Uuml;bertragungsvorgang gestartet. 
  Anschlie&szlig;end erscheint die Datei im Verzeichnisbaum auf der linken Seite.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn Sie auf die 
  Datei klicken wird Ihnen ein Download der Datei angeboten. Falls Sie darauf 
  klicken k&ouml;nnen Sie kontrollieren, wie sp&auml;ter eine Verlinkung auf dieses 
  Dokument funktioniert - nat&uuml;rlich kann die Darstellung auf Ihrem Rechner 
  von der auf anderen Rechnern abweichen, je nach Konfiguration des Browsers, 
  denn es kann vorkommen, dass auf &auml;lteren Rechnern noch nicht die aktuellen 
  Browser mit allen zugeh&ouml;rigen Plug-Ins (Erweiterungen f&uuml;r Zusatzfunktionen) 
  installiert sind.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Um die hochgeladene 
  Datei in ein Dokument einzubinden, rufen Sie es durch Anwahl im Men&uuml; &#132;Editieren&#147; 
  auf und w&auml;hlen den Seitenbereich, in den es eingebunden werden soll.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Nun legen Sie ein 
  neues Objekt vom Typ &#132;Media Link&#147; an. Geben Sie den Linknamen an, 
  d.h. den Text, der angezeigt werden soll und auf den man klicken kann, um das 
  verlinkte Dokument aufzurufen. Dann w&auml;hlen Sie per Drop-Down-Men&uuml; 
  den Pfad und die Datei in Ihrer Mediendatenbank. Geben Sie noch an, ob das Dokument 
  in einem neuen Fenster ge&ouml;ffnet werden soll. Dies bietet sich bei Mediendaten 
  an, weil sich ihr Erscheinungsbild doch von dem von Internetseiten unterscheidet 
  und Ihre Site ja weiterhin sichtbar sein soll.<br>
  Best&auml;tigen Sie mit &#132;&Uuml;bernehmen&#147; und schauen Sie sich das 
  Ergebnis mit der Seitenvorschaufunktion an. Der Link auf die Mediendatei funktioniert 
  allerdings erst, wenn Sie auf den Demo-Server bzw. Server publiziert haben, 
  da Mediendaten erst in diesem Moment aus der Mediendatenbank auf den Server 
  gespielt werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Um Ihre &Auml;nderungen 
  zu publizieren m&uuml;ssen Sie Ihre Site noch auf den Server spielen (Men&uuml; 
  &#132;Speichern&#147; bzw. zur Kontrolle zun&auml;chst die &#132;Vorschau&#147; 
  auf dem Demo-Server).</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b></p>
<hr>
<font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><br>
<font size="4"><a name="begriffe"></a>Wichtige Begriffe:</font></font></b></font> 
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3">Layout-Vorlagen:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Layout-Vorlagen 
  - auch Templates genannt - bilden das Grundger&uuml;st Ihrer Internetseiten. 
  Dort ist das Aussehen der Webseite festgelegt. In der Vorlage sind Platzhalter 
  (editierbare Seitenbereiche) eingesetzt, wo sp&auml;ter der von Ihnen eingepflegte 
  Inhalt (Texte, Bilder, Verzweigungen (Links), ...) stehen soll. Aus den Layout-Vorlagen 
  und den angegebenen Inhalten erstellt Pagix dann fertige Internetseiten und 
  macht diese zug&auml;nglich.Layout-Vorlagen - auch Templates genannt - bilden 
  das Grundger&uuml;st Ihrer Internetseiten. Dort ist das Aussehen der Webseite 
  festgelegt. In der Vorlage sind Platzhalter (editierbare Seitenbereiche) eingesetzt, 
  wo sp&auml;ter der von Ihnen eingepflegte Inhalt (Texte, Bilder, Verzweigungen 
  (Links), ...) stehen soll. Aus den Layout-Vorlagen und den angegebenen Inhalten 
  erstellt Pagix dann fertige Internetseiten und macht diese zug&auml;nglich.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3">Objekte:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Objekte sind Platzhalter 
  f&uuml;r Inhalte, die Sie selbst eingeben oder austauschen. Diese Inhalte k&ouml;nnen 
  verschiedener Struktur sein: Texte, Bilder (mit feststehenden oder flexiblen 
  Gr&ouml;&szlig;en), &Uuml;berschriften, Zwischen&uuml;berschriften, Interne 
  Links (Verzweigungen), Externe Links (Verzweigungen), Media-Links (Verzweigungen 
  auf Medien) und Tabellen. Wie die einzelnen Objekte aussehen, d.h. z.B. Farbe, 
  Gr&ouml;&szlig;e und Ausrichtung von Texten und &Uuml;berschriften, wird &auml;hnlich 
  wie bei den Layout-Vorlagen, vom Designer in den Objekt-Vorlagen zuvor festgelegt. 
  Auch hier kann zumeist aus mehreren Alternativen gew&auml;hlt werden.<br>
  </font><font face="Verdana, Arial, Helvetica, sans-serif"> </font> </p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3">Editierbare 
  Seitenbereiche:</font></b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Editierbare Seitenbereiche 
  fassen zumeist Objekte zusammen - allerdings sind auch Seitenbereiche mit nur 
  einem Objekt oder auch (vor&uuml;bergehend) ganz leere editierbare Seitenbereiche 
  m&ouml;glich. Es k&ouml;nnen editierbare Seitenbereiche f&uuml;r verschiedene 
  Anwendungen zusammengestellt werden (z.B. Newslisten oder Produkt&uuml;bersichten). 
  Welche und wieviele Objekte bzw. Objekttypen ein editierbarer Seitenbereich 
  enthalten kann, wird im Bereich Verwalten definiert. Die Reihenfolge der Objekte 
  sowie die Anzahl, soweit sie nicht &uuml;ber die zuvor definierte Maximalanzahl 
  hinausgeht, kann dann sp&auml;ter w&auml;hrend des Editierens beliebig festgelegt 
  und ge&auml;ndert werden.</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="3"><b>Objekt-Vorlagen:</b></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Objekt-Vorlagen 
  definieren das Aussehen von Objekten. Hier legt der Designer fest, wie z.B. 
  Texte hinsichtlich Farbe, Gr&ouml;&szlig;e, Schriftart und Ausrichtung aussehen. 
  Weitere m&ouml;gliche Definitionen betreffen die Gr&ouml;&szlig;e und den Freiraum 
  von Bildern. Durch das Bereitstellen unterschiedlicher Objekt-Vorlagen kann 
  somit Einfluss auf das Erscheinungsbild der Seiten genommen werden. Die Objekt-Vorlagen 
  sind auf das Gesamtlayout der Seitenlayoutvorlagen der Site abgestimmt.<br>
  </font><font face="Verdana, Arial, Helvetica, sans-serif"> </font> </p>
<p></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b> </p>
<hr>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="2"><b><font size="3"><font size="4"><a name="informationen"></a>Informationen:</font></font></b></font> 
</p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">net AG - Medien 
  -</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Simeonscarr&egrave; 
  2<br>
  D-32427 Minden</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Fon: 0571/9450 
  - 125<br>
  Fax: 0571/9450 - 299</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">E-Mail: webdesign@net.de</font></p>
<p><b><font face="Verdana, Arial, Helvetica, sans-serif" size="1"><a href="#menue">&lt;&lt; 
  zur&uuml;ck</a></font></b> </p>
<hr>
</body>
</html>
