<html>
<head>
<title>Pagix Kontext-Hilfe</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#000000" vlink="#000000" alink="#000000" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<script language="JavaScript">
focus();
</script><p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Pagix Kontext-Hilfe</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Objekte sind Platzhalter 
  f&uuml;r Inhalte, die Sie selbst eingeben oder austauschen. Inhalte k&ouml;nnen 
  z. B. sein: Texte, Bilder, &Uuml;berschriften, Zwischen&uuml;berschriften, Interne 
  Links (Verzweigungen), Externe Links (Verzweigungen), Media-Links (Verzweigungen 
  auf Medien).<br>
  </font><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Wenn Sie 
  ein <b>neues Objekt einf&uuml;gen</b> wollen, dann w&auml;hlen Sie unter &quot;Neues 
  Objekt einf&uuml;gen&quot; per Drop-Down-Men&uuml; den gew&uuml;nschten Objekttyp 
  aus (falls mehrere Objekttypen m&ouml;glich sind) und klicken dann auf &quot;&Uuml;bernehmen&quot;. 
  <br>
  Bei <b>&quot;Text&quot;</b> (und auch <b>&quot;&Uuml;berschriften&quot;</b> 
  und <b>&quot;Zwischen&uuml;berschriften&quot;</b>) geben Sie den gew&uuml;nschten 
  Text in die Maske ein und klicken auf &quot;&Uuml;bernehmen&quot;. <br>
  Bei <b>&quot;Interner Link&quot;</b> k&ouml;nnen Sie per Drop-Down-Men&uuml; 
  die Seite bestimmen, auf die verzweigt werden soll, wenn der Linkname, den Sie 
  vergeben, angeklickt wird. Sie k&ouml;nnen mit der Option &quot;Link in neuem 
  Fenster &ouml;ffnen&quot; beim Anklicken das &Ouml;ffnen eines neuen Fensters 
  erzwingen. Ansonsten wird in das bestehende Fenster verlinkt. Best&auml;tigen 
  Sie Ihre Eingaben wiederum mit &quot;&Uuml;bernehmen&quot;. <br>
  Das Medium <b>&quot;Bild&quot;</b> setzt voraus, dass das entsprechende Bild 
  schon auf den Server geladen wurde. Sehen Sie dazu unter der Rubrik &quot;Medien&quot; 
  nach. Wiederum per Drop-Down-Men&uuml; k&ouml;nnen Sie aus der Liste der zur 
  Verf&uuml;gung stehenden Bilder ausw&auml;hlen, nachdem der gew&uuml;nschte 
  Verzeichnispfad ausgew&auml;hlt wurde. Weiterhin besteht die M&ouml;glichkeit, 
  das ausgesuchte Bild mit einer Verzweigung (Link) zu versehen, um bei Klick 
  darauf zu einer anderen Seite zu gelangen - w&auml;hlen Sie dazu die entsprechende 
  Option &quot;Ja&quot;. Einen Link ausserhalb Ihrer Internetpr&auml;senz m&uuml;ssen 
  Sie direkt eingeben (in der Form: &quot;http://www.domain.de/seite.html&quot;). 
  Eine Verlinkung innerhalb Ihrer Site k&ouml;nnen Sie per Drop-Down-Men&uuml; 
  ausw&auml;hlen. Best&auml;tigen Sie Ihre Auswahl mit &quot;&Uuml;bernehmen. 
  <br>
  Beim Objekttyp <b>&quot;Media Link&quot;</b> geben Sie zun&auml;chst den Text 
  des Links ein. Mittels Drop-Down-Men&uuml;s w&auml;hlen Sie dann Verzeichnispfad 
  und Dateiname des Bildes aus. Gegebenenfalls w&auml;hlen Sie noch die Option 
  &quot;Link in neuem Fenster &ouml;ffnen&quot; und best&auml;tigen mit &quot;&Uuml;bernehmen&quot;.<br>
  Den Objekten sind jeweils die <b>Optionen &quot;L&ouml;schen&quot; und &quot;Verschieben&quot;</b> 
  zugeordnet. Mit &quot;L&ouml;schen&quot; entfernen Sie das zugeordnete Objekt&quot;. 
  Mit &quot;Verschieben&quot; k&ouml;nnen Sie die Reihenfolge der Objekte ver&auml;ndern, 
  wenn der Platzhalter (editierbarer Seitenbereich) mehr als nur ein Objekt beinhaltet.<br>
  Wenn Sie auf <b>&quot;Seitenvorschau&quot;</b> klicken, wird Ihnen das Ergebnis 
  Ihrer Eingaben angezeigt. Aus technischen Gr&uuml;nden kann diese Darstellung 
  aber noch von der sp&auml;teren tats&auml;chlichen Darstellung abweichen, wenn 
  die neue Seite im Kontext von anderen Seiten angezeigt wird.</font> <font face="Verdana, Arial, Helvetica, sans-serif" size="1"><br>
  Nach allen Eingaben k&ouml;nnen Sie mit <b>&quot;zur&uuml;ck&quot;</b> wieder 
  zur &Uuml;bersicht der editierbare Seitenbereiche der Seite gelangen. </font></p>
</body>
</html>
