<html>
<head>
<title>Pagix Kontext-Hilfe</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000" link="#000000" vlink="#000000" alink="#000000" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<script language="JavaScript">
focus();
</script><p><font face="Verdana, Arial, Helvetica, sans-serif" size="2">Pagix Kontext-Hilfe</font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif" size="1">Falls Sie einen 
  neuen editierbaren Seitenbereich anlegen, geben Sie zun&auml;chst unter &quot;Seitenbereich&quot; 
  die genaue Bezeichnung des Platzhalters ein, wie er in der html-Vorlage benannt 
  ist. Weiterhin geben Sie die maximale Anzahl der m&ouml;glichen Objekte des 
  Seitenbereichs an - wenn Sie &quot;0&quot; angeben, bleibt die Anzahl undefiniert. 
  Falls Sie den Objekttyp &quot;Bild mit Auto-Gr&ouml;&szlig;e&quot; verwenden 
  wollen, geben Sie hier die gew&uuml;nschte Bildgr&ouml;&szlig;e bzw. maximale 
  Bildgr&ouml;&szlig;e an. Nach der Best&auml;tigung k&ouml;nnen Sie nun die einzelnen 
  Objekte des Seitenbereichs definieren. W&auml;hlen Sie dazu aus dem Drop-Down-Men&uuml; 
  den gew&uuml;nschten Objekttyp und klicken dann auf &quot;Neues Objekt&quot;. 
  Das neue Objekt erscheint in einer Liste. Hier m&uuml;ssen Sie nun angeben, 
  wie oft ein Objekt dieses Objekttyps in dem editierbaren Seitenbereich maximal 
  vorkommen soll. Au&szlig;erdem m&uuml;ssen Sie aus dem Drop-Down-Men&uuml; &quot;Vorlage&quot; 
  die gew&uuml;nschte Objekt-Vorlage dem Objekt zuordnen. In den Objekt-Vorlagen 
  hat der Designer das Erscheinungsbild f&uuml;r die Objekte festgelegt, z.B. 
  die Farbe, Gr&ouml;&szlig;e und Schriftart von Text, oder die Gr&ouml;&szlig;e 
  und den Freistellraum von Bildern. Nach dieser Zuordnung k&ouml;nnen Sie weitere 
  Objekte anlegen. Mit &quot;zur&uuml;ck&quot; kommen Sie auf die &Uuml;bersicht 
  der editierbaren Seitenbereiche. Auch hier k&ouml;nnen Sie nun weitere editierbare 
  Seitenbereiche - wenn in der Vorlage so vorgesehen - nach dem geschilderten 
  Schema definieren. Nach diesen Definitionen k&ouml;nnen auf Basis dieser Vorlage 
  Seiten erstellt und mit Inhalt gef&uuml;llt werden. Wenn Sie einen schon bestehenden 
  editierbaren Seitenbereich ver&auml;ndern wollen, so &auml;ndern Sie die bisherigen 
  Einstellungen so, wie Sie es w&uuml;nschen. Vergessen Sie nicht, jede &Auml;nderung 
  mit dem jeweiligen &quot;&Uuml;bernehmen&quot;-Button zu best&auml;tigen.</font></p>
</body>
</html>
